{"modelTopology": {"node": [{"name": "Output/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/OutBlock/Conv/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/OutBlock/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/InBlock/Conv/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/InBlock/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "Generator/DBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/Conv/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_1/SEUnit/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Generator/EBlock_0/ResBlock_0/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/Upsample/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Generator/DBlock_3/Upsample/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Generator/DBlock_3/Upsample/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Generator/DBlock_3/Upsample/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Generator/EBlock_1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "96"}]}}}}}, {"name": "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/Conv_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "Generator/EBlock_2/ResBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_1/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_1/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_1/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_1/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_1/Conv_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "Generator/EBlock_2/ResBlock_1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "96"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_0/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_0/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_0/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_0/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_0/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_1/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_1/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_1/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_1/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_3/ResBlock_1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_0/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_0/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_0/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_0/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_0/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_1/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_1/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_1/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_1/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_3/ResBlock_1/Conv/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "Generator/DBlock_2/ResBlock_0/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_0/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_0/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_0/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_0/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_1/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Generator/DBlock_2/ResBlock_1/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_1/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_1/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_2/ResBlock_1/Conv/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Generator/DBlock_1/ResBlock_0/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_0/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_0/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_0/SEUnit/fully_connected/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}}}, {"name": "Generator/DBlock_1/ResBlock_0/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_1/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Generator/DBlock_1/ResBlock_1/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_1/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_1/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_1/ResBlock_1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_0/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_0/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}}}, {"name": "Generator/DBlock_0/ResBlock_0/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_0/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_0/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_0/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_1/SEUnit/fully_connected_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_1/SEUnit/fully_connected_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_1/SEUnit/fully_connected/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_1/SEUnit/fully_connected/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Generator/DBlock_0/ResBlock_1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "mul", "op": "Mul", "input": ["Input", "mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["mul", "sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/InBlock/Conv/Conv2D", "op": "Conv2D", "input": ["sub", "Generator/InBlock/Conv/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Generator/OutBlock/add", "op": "Add", "input": ["sub/y", "sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/InBlock/Conv/BiasAdd", "op": "BiasAdd", "input": ["Generator/InBlock/Conv/Conv2D", "Generator/InBlock/Conv/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Generator/EBlock_0/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/InBlock/Conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/Swish/mul", "op": "Mul", "input": ["Generator/InBlock/Conv/BiasAdd", "Generator/EBlock_0/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/Conv/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_0/Swish/mul", "Generator/EBlock_0/Conv/weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_0/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_0/Conv/Conv2D", "Generator/EBlock_0/ResBlock_0/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/Conv/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_0/ResBlock_0/Swish/mul", "Generator/EBlock_0/ResBlock_0/Conv/weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/Conv/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_0/ResBlock_0/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/Conv/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_0/ResBlock_0/Conv/Conv2D", "Generator/EBlock_0/ResBlock_0/Conv/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/Conv_1/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_0/ResBlock_0/Conv/Swish/mul", "Generator/EBlock_0/ResBlock_0/Conv_1/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/Mean", "op": "Mean", "input": ["Generator/EBlock_0/ResBlock_0/Conv_1/Conv2D", "Generator/DBlock_0/ResBlock_1/SEUnit/Mean/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/MatMul", "op": "MatMul", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/Mean", "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/MatMul", "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/biases"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/Relu", "op": "Relu", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/MatMul", "op": "MatMul", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected/Relu", "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/MatMul", "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/ExpandDims", "op": "ExpandDims", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/fully_connected_1/Sigmoid", "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/ExpandDims_1", "op": "ExpandDims", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/ExpandDims", "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/SEUnit/Mul", "op": "Mul", "input": ["Generator/EBlock_0/ResBlock_0/Conv_1/Conv2D", "Generator/EBlock_0/ResBlock_0/SEUnit/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_0/add", "op": "Add", "input": ["Generator/EBlock_0/ResBlock_0/SEUnit/Mul", "Generator/EBlock_0/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_0/ResBlock_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_0/ResBlock_0/add", "Generator/EBlock_0/ResBlock_1/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/Conv/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_0/ResBlock_1/Swish/mul", "Generator/EBlock_0/ResBlock_1/Conv/weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/Conv/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_0/ResBlock_1/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/Conv/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_0/ResBlock_1/Conv/Conv2D", "Generator/EBlock_0/ResBlock_1/Conv/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/Conv_1/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_0/ResBlock_1/Conv/Swish/mul", "Generator/EBlock_0/ResBlock_1/Conv_1/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/Mean", "op": "Mean", "input": ["Generator/EBlock_0/ResBlock_1/Conv_1/Conv2D", "Generator/DBlock_0/ResBlock_1/SEUnit/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/MatMul", "op": "MatMul", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/Mean", "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/weights"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/MatMul", "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/Relu", "op": "Relu", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/MatMul", "op": "MatMul", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected/Relu", "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/MatMul", "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/biases"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/ExpandDims", "op": "ExpandDims", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/fully_connected_1/Sigmoid", "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/ExpandDims_1", "op": "ExpandDims", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/ExpandDims", "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/SEUnit/Mul", "op": "Mul", "input": ["Generator/EBlock_0/ResBlock_1/Conv_1/Conv2D", "Generator/EBlock_0/ResBlock_1/SEUnit/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_0/ResBlock_1/add", "op": "Add", "input": ["Generator/EBlock_0/ResBlock_1/SEUnit/Mul", "Generator/EBlock_0/ResBlock_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_0/ResBlock_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_0/ResBlock_1/add", "Generator/EBlock_1/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/Conv/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_1/Swish/mul", "Generator/EBlock_1/Conv/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Generator/EBlock_1/ResBlock_0/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_1/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_1/Conv/Conv2D", "Generator/EBlock_1/ResBlock_0/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/Conv/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_1/ResBlock_0/Swish/mul", "Generator/EBlock_1/ResBlock_0/Conv/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Generator/EBlock_1/ResBlock_0/Conv/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_1/ResBlock_0/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/Conv/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_1/ResBlock_0/Conv/Conv2D", "Generator/EBlock_1/ResBlock_0/Conv/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/Conv_1/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_1/ResBlock_0/Conv/Swish/mul", "Generator/EBlock_1/ResBlock_0/Conv_1/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/Mean", "op": "Mean", "input": ["Generator/EBlock_1/ResBlock_0/Conv_1/Conv2D", "Generator/DBlock_0/ResBlock_1/SEUnit/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/MatMul", "op": "MatMul", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/Mean", "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/weights"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/MatMul", "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/Relu", "op": "Relu", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/MatMul", "op": "MatMul", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected/Relu", "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/weights"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/MatMul", "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/ExpandDims", "op": "ExpandDims", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/fully_connected_1/Sigmoid", "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/ExpandDims_1", "op": "ExpandDims", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/ExpandDims", "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "Generator/EBlock_1/ResBlock_0/SEUnit/Mul", "op": "Mul", "input": ["Generator/EBlock_1/ResBlock_0/Conv_1/Conv2D", "Generator/EBlock_1/ResBlock_0/SEUnit/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_0/add", "op": "Add", "input": ["Generator/EBlock_1/ResBlock_0/SEUnit/Mul", "Generator/EBlock_1/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_1/ResBlock_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_1/ResBlock_0/add", "Generator/EBlock_1/ResBlock_1/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/Conv/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_1/ResBlock_1/Swish/mul", "Generator/EBlock_1/ResBlock_1/Conv/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Generator/EBlock_1/ResBlock_1/Conv/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_1/ResBlock_1/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/Conv/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_1/ResBlock_1/Conv/Conv2D", "Generator/EBlock_1/ResBlock_1/Conv/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/Conv_1/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_1/ResBlock_1/Conv/Swish/mul", "Generator/EBlock_1/ResBlock_1/Conv_1/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/Mean", "op": "Mean", "input": ["Generator/EBlock_1/ResBlock_1/Conv_1/Conv2D", "Generator/DBlock_0/ResBlock_1/SEUnit/Mean/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/MatMul", "op": "MatMul", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/Mean", "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/MatMul", "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/Relu", "op": "Relu", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/MatMul", "op": "MatMul", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected/Relu", "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/MatMul", "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/ExpandDims", "op": "ExpandDims", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/fully_connected_1/Sigmoid", "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/ExpandDims_1", "op": "ExpandDims", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/ExpandDims", "Generator/DBlock_0/ResBlock_1/SEUnit/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/SEUnit/Mul", "op": "Mul", "input": ["Generator/EBlock_1/ResBlock_1/Conv_1/Conv2D", "Generator/EBlock_1/ResBlock_1/SEUnit/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_1/ResBlock_1/add", "op": "Add", "input": ["Generator/EBlock_1/ResBlock_1/SEUnit/Mul", "Generator/EBlock_1/ResBlock_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_1/ResBlock_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_1/ResBlock_1/add", "Generator/EBlock_2/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/Conv/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_2/Swish/mul", "Generator/EBlock_2/Conv/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Generator/EBlock_2/ResBlock_0/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_2/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_2/Conv/Conv2D", "Generator/EBlock_2/ResBlock_0/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/Conv/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_2/ResBlock_0/Swish/mul", "Generator/EBlock_2/ResBlock_0/Conv/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Generator/EBlock_2/ResBlock_0/Conv/Swish/Sigmoid", "op": "Sigmoid", "input": ["Generator/EBlock_2/ResBlock_0/Conv/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/Conv/Swish/mul", "op": "Mul", "input": ["Generator/EBlock_2/ResBlock_0/Conv/Conv2D", "Generator/EBlock_2/ResBlock_0/Conv/Swish/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/Conv_1/Conv2D", "op": "Conv2D", "input": ["Generator/EBlock_2/ResBlock_0/Conv/Swish/mul", "Generator/EBlock_2/ResBlock_0/Conv_1/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Generator/EBlock_2/ResBlock_0/SEUnit/Mean", "op": "Mean", "input": ["Generator/EBlock_2/ResBlock_0/Conv_1/Conv2D", "Generator/DBlock_0/ResBlock_1/SEUnit/Mean/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected/MatMul", "op": "MatMul", "input": ["Generator/EBlock_2/ResBlock_0/SEUnit/Mean", "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected/weights"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected/BiasAdd", "op": "BiasAdd", "input": ["Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected/MatMul", "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Generator/EBlock_2/ResBlock_0/SEUnit/fully_connected/Relu", "op": "Relu", "input": 